

factories = ["华为", "中兴", "阿尔卡特"]

# MSE = [
#     ["大沥MSE-1","113.98.172.179","大沥","huawei","NE40E-X16"],
#     ["大沥MSE-2","113.98.172.180","大沥","huawei","NE40E-X16"],
#     ["里水MSE-1","113.98.172.177","里水","huawei","NE40E-X16"],
#     ["里水MSE-2","113.98.172.178","里水","huawei","NE40E-X16"],
#     ["西樵MSE-1","113.98.172.195","西樵","huawei","NE40E-X16"],
#     ["西樵MSE-2","113.98.172.196","西樵","huawei","NE40E-X16"],
#     ["黄岐MSE-1","113.98.172.184","黄岐","huawei","NE40E-X16"],
#     ["黄岐MSE-2","113.98.172.185","黄岐","huawei","NE40E-X16"],
#     ["盐步MSE-1","113.98.172.187","盐步","huawei","NE40E-X16"],
#     ["盐步MSE-2","113.98.172.188","盐步","huawei","NE40E-X16"],
#     ["金沙MSE-1","113.98.172.192","金沙","huawei","NE40E-X16"],
# #    ["金沙MSE-2","113.98.172.186","金沙","huawei","NE40E-X16"],
#     ["金沙MSE-3","61.146.57.100","金沙","huawei","NE40E-X16"],
#     ["金沙MSE-4","119.145.177.70","金沙","huawei","NE40E-X16"],
#     ["桂江MSE-1","113.98.172.189","桂城","huawei","NE40E-X16"],
#     ["桂江MSE-2","113.98.172.190","桂城","huawei","NE40E-X16"],
#     ["桂城MSE-1","113.98.172.191","桂城","zte","M6000"],
#     ["平洲MSE-1","113.98.172.198","平洲","huawei","NE40E-X16"],
#     ["平洲MSE-2","113.98.172.199","平洲","huawei","NE40E-X16"],
#     ["九江MSE-1","113.98.172.197","九江","huawei","NE40E-X16"],
#     ["官窑MSE-1","113.98.172.182","官窑","zte","M6000"],
#     ["丹灶MSE-1","113.98.172.194","丹灶","zte","M6000"],
#     ["和顺MSE-1","113.98.172.176","和顺","zte","M6000"],
#     ["罗村MSE-1","113.98.172.193","罗村","zte","M6000"],
#     ["松岗MSE-1","113.98.172.183","松岗","zte","M6000"],
# ]

MSE_LIST = [
    ['GD-FS-NHDL-MSE-1.MAN.NE40E', '大沥MSE-1', '113.98.172.179', '大沥', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHDL-MSE-2.MAN.NE40E', '大沥MSE-2', '113.98.172.180', '大沥', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHLS-MSE-1.MAN.NE40E', '里水MSE-1', '113.98.172.177', '里水', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHLS-MSE-2.MAN.NE40E', '里水MSE-2', '113.98.172.178', '里水', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHXQ-MSE-1.MAN.NE40E', '西樵MSE-1', '113.98.172.195', '西樵','huawei', 'NE40E-X16'],
    ['GD-FS-NHXQ-MSE-2.MAN.NE40E', '西樵MSE-2', '113.98.172.196', '西樵', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHHQ-MSE-1.MAN.NE40E','黄岐MSE-1', '113.98.172.184', '黄岐', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHHQ-MSE-2.MAN.NE40E', '黄岐MSE-2', '113.98.172.185', '黄岐', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHYB-MSE-1.MAN.NE40E', '盐步MSE-1', '113.98.172.187', '盐步', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHYB-MSE-2.MAN.NE40E', '盐步MSE-2', '113.98.172.188', '盐步', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHJS-MSE-1.MAN.NE40E', '金沙MSE-1', '113.98.172.192', '金沙', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHJS-MSE-3.MAN.NE40E', '金沙MSE-3', '61.146.57.100', '金沙', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHJS-MSE-4.MAN.NE40E', '金沙MSE-4', '119.145.177.70', '金沙', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHGJ-MSE-1.MAN.NE40E', '桂江MSE-1', '113.98.172.189', '桂城', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHGJ-MSE-2.MAN.NE40E', '桂江MSE-2', '113.98.172.190', '桂城', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHGC-MSE-1.MAN.M6000', '桂城MSE-1', '113.98.172.191', '桂城', 'zte', 'M6000'],
    ['GD-FS-NHPZ-MSE-1.MAN.NE40E', '平洲MSE-1', '113.98.172.198', '平洲', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHPZ-MSE-2.MAN.NE40E', '平洲MSE-2', '113.98.172.199', '平洲', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHJJ-MSE-1.MAN.NE40E', '九江MSE-1', '113.98.172.197', '九江', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHGY-MSE-1.MAN.M6000', '官窑MSE-1', '113.98.172.182', '官窑', 'zte', 'M6000'],
    ['GD-FS-NHDZ-MSE-1.MAN.M6000', '丹灶MSE-1', '113.98.172.194', '丹灶','zte', 'M6000'],
    ['GD-FS-NHHS-MSE-1.MAN.M6000', '和顺MSE-1', '113.98.172.176', '和顺', 'zte', 'M6000'],
    ['GD-FS-NHLC-MSE-1.MAN.M6000', '罗村MSE-1', '113.98.172.193', '罗村', 'zte', 'M6000'],
    ['GD-FS-NHSG-MSE-1.MAN.M6000', '松岗MSE-1', '113.98.172.183', '松岗', 'zte', 'M6000']
]

TEST_LIST = [
    ['GD-FS-NHDL-MSE-1.MAN.NE40E', '大沥MSE-1', '113.98.172.179', '大沥', 'huawei', 'NE40E-X16'],
    ['GD-FS-NHSG-MSE-1.MAN.M6000', '松岗MSE-1', '113.98.172.183', '松岗', 'zte', 'M6000']
]
